Repository: liyishibeck-ctrl/Buddhist_Text_Analysis_Platform
Catalog: data/raw/tibetan/84000/data-translation-memory-master/toh94-v2.tmx
Source language: bo
Languages: en

source: བྱང་ཆུབ་ཀྱི་སྙིང་པོར་ཟང་ཟིང་མེད་པའི་བསམ་གཏན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the perfection of concentration free from disturbance at the seat of awakening.

source: ཤིན་ཏུ་སྦྱངས་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline brings the perfect factor of awakening based on ease.

source: དགའ་བ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience brings the perfect factor of awakening based on joy.

source: ཆོས་རྣམ་པར་འབྱེད་པ་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence brings the perfect factor of awakening based on discernment of phenomena.

source: ཏིང་ངེ་འཛིན་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration brings the perfect factor of awakening based on absorption.

source: བཏང་སྙོམས་ཡང་དག་བྱང་ཆུབ་ཀྱི་ཡན་ལག་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight brings the perfect factor of awakening based on equanimity.

source: འདི་དག་ནི་མཉམ་པར་བཞག་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of equipoise.

source: དེ་ལ་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of ripening?

source: བྱང་ཆུབ་བརྙེས་ནས་གང་དག་སེམས་ཅན་ཡོངས་སུ་སྨིན་པར་མཛད་པའི་ཕྱིར་བཏང་སྙོམས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as equanimity for the sake of ripening beings after one has achieved awakening.

source: གསོལ་བ་མ་བཏབ་པར་ཆོས་མི་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ensures that one does not teach the Dharma without having been requested to do so.

source: ཐེག་པ་དམན་པ་ལ་མོས་པ་རྣམས་ལ་ལུས་དམན་པ་མངོན་པར་སྤྲུལ་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes one emanate inferior bodies in the midst of those who are inclined toward the inferior vehicle.

source: ལྟེང་རྒྱས་འོད་སྲུང་ལ་གདམས་ངག་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is that which imparted instructions to Uruvilvā Kāśyapa.

source: སེམས་ཅན་རྣམས་ཀྱིས་ཞུ་བ་ཞུས་པ་ལ་སྐྱོ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration makes one never tire of the questions posed by sentient beings.

source: ཞུས་པའི་ལན་འདེབས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as answering the questions.

source: འདི་དག་ནི་ཡོངས་སུ་སྨིན་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of ripening.

source: དེ་ལ་སངས་རྒྱས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the buddhas?

source: འབྲས་བུ་ཡོད་པའི་ཆོས་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as teaching the Dharma that bears fruit.

source: སངས་རྒྱས་ཀྱིས་མཛད་པ་འབྲས་བུ་ཡོད་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline accomplishes fruitful buddha activities.

source: ངེས་པའི་ཚིག་ཐམས་ཅད་ལ་སྤོབས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience accomplishes the acumen for language.

source: ཆོས་རྣམས་ལ་བརྗེད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ensures that the teachings of the Dharma are not forgotten.

source: ཐམས་ཅད་དུ་འགྲོ་བའི་ལམ་གྱི་སྟོབས་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration brings the power of the universal path.

source: མི་འཇིགས་པ་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the realization of fearlessness.

source: འདི་དག་ནི་སངས་རྒྱས་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the buddhas.

source: དེ་ལ་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of omniscience?

source: ཐམས་ཅད་མཁྱེན་པའི་ཡེ་ཤེས་ཐོགས་པ་མེད་པའི་སྤྱན་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the eye of the unimpeded wisdom of omniscience.

source: འཁོར་གྱི་སེམས་ཚར་གཅད་པ་དང་སེམས་རབ་ཏུ་འཛིན་པ་མཁྱེན་ནས་ཆོས་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is to teach the Dharma by understanding how to overcome and support the minds of beings in the audience.

source: བསྙེན་པར་དཀའ་བ་ལ་ཞེ་ས་དང་བཅས་པས་ཉན་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience makes one listen respectfully to those who are hard to please.

source: དུས་མཁྱེན་ནས་ཆོས་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence makes one teach the Dharma in a timely fashion.

source: ལྷག་ཆད་མེད་པར་ཆོས་སྟོན་པ་ལ་མཁས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration brings mastery in teaching the Dharma without adding or subtracting anything.

source: མོས་པ་ཇི་ལྟ་བ་བཞིན་ཐེག་པའི་གཏམ་གོ་བར་མཛད་ཅིང་ཆེད་དུ་བརྗོད་པ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight enables one to impart understanding of the teaching of the vehicles in accordance with the inclinations of the audience and to engage in purposeful expression.

source: འདི་དག་ནི་ཐམས་ཅད་མཁྱེན་པ་ཉིད་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of omniscience.

source: དེ་ལ་ལྷག་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections without remainder?

source: ལམ་སླ་བ་མྱུར་བས་ངེས་པར་བྱུང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as deliverance by means of an easy and fast path.

source: བདེ་བར་མྱུར་དུ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline brings ripening in a way that is delightful and quick.

source: སངས་རྒྱས་ཀྱི་བསྟན་པ་གཞན་དུ་མི་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ensures that the teachings of the buddhas do not turn into something else.

source: དུས་གསུམ་ལ་གཞོལ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence brings commitment throughout the three times.

source: བསམ་གཏན་དང་རྣམ་པར་ཐར་པ་དང་། ཏིང་ངེ་འཛིན་དང་། སྙོམས་པར་འཇུག་པ་རྣམས་ལ་ཇི་ལྟར་འདོད་པ་བཞིན་དུ་སྙོམས་པར་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration enables equipoise within the concentrations, liberations, absorptions, and meditative attainments according to one’s wishes.

source: ཐ་དད་དུ་མི་སྟོན་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as not teaching in terms of distinctions.

source: འདི་དག་ནི་ལྷག་མ་མེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections without remainder.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྐུ་གདུང་དང་བསྟན་པའི་འབྲས་བུ་འགྲུབ་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the relics following parinirvāṇa, and the fruition of the teachings.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་ཚུལ་ཁྲིམས་རྗེས་སུ་དྲན་པ་ལ་ཉམས་པ་མེད་པར་འགྱུར་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ensures unimpaired recollection of the discipline associated with parinirvāṇa.

source: དེ་བཞིན་གཤེགས་པའི་མཆོད་རྟེན་ལ་མར་མེ་འབུལ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is the offering of butter lamps at the stūpas of the thus-gone ones.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་བསྟན་པ་ལ་ཉན་ཐོས་གནས་པ་བརྩོན་འགྲུས་བརྩམས་པ་ལ་བར་ཆད་མི་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ensures that the hearers abide by the teaching of the parinirvāṇa and develop diligence.

source: རྣམ་པར་འཕྲུལ་པ་མཐར་གྱིས་སྙོམས་པར་འཇུག་པ་ཞེས་བྱ་བ་འཐོབ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration brings the accomplishment of the so-called miraculous successive meditative attainments.

source: འཇིག་རྟེན་ལས་འདས་པའི་ཤེས་རབ་ཀྱི་དབང་པོ་ལ་རབ་ཏུ་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as engagement with the faculty of insight beyond the world.

source: འདི་དག་ནི་ལྷག་མ་དང་བཅས་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections with remainder.

source: དེ་ལ་དང་དུ་ལེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of joyful acceptance?

source: འདི་ལྟར་སེམས་བསྟན་པ་ལ་སེམས་ཅན་རྣམས་རྙེད་པ་དང་བཀུར་སྟི་ལ་ལོངས་སྤྱོད་ཅིང་ཡུལ་ལ་སྤྱོད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as demonstrating the mind of awakening in such a way that sentient beings enjoy wealth and respect and make use of objects.

source: བྷ་ར་དྭཱ་ཛ་ཁྲོས་ཀྱང་མ་འཁྲུགས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is what makes one unaffected by Bhāradvāja’s anger.

source: མཛེས་ལྡན་མོའི་ཕྱིར་མུ་སྟེགས་པ་ཁྲི་ཉིས་སྟོང་གིས་མི་སྙན་པར་བསྒྲགས་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is that demonstrated when being defamed by twelve thousand non-Buddhists because of Sundarī.

source: ཡིད་ཀྱིས་མཐུ་སྟོབས་བསྟན་པ་ནི་དཔེར་ན་བྱང་ཆུབ་སེམས་དཔའ་སེང་གེར་གྱུར་པ་ན་གནད་དུ་ཕོག་ཀྱང་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is the demonstration of mental strength, as exemplified by the Bodhisattva who, in his life as a lion, gladly accepted being mortally wounded.

source: བཀུར་སྟི་མ་བྱས་ཀྱང་དང་དུ་ལེན་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration engenders acceptance even if no one pays one respect.

source: བསམ་གཏན་གྱི་ཕྱིར་འདྲི་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as questions that concern concentration.

source: འདི་དག་ནི་དང་དུ་ལེན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of joyful acceptance.

source: དེ་ལ་རྟོགས་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections that foster realization?

source: ཆོས་བསྟན་པ་གང་གིས་འོག་མིན་གྱི་གནས་ནས་བཟུང་ནས་སངས་རྒྱས་ཀྱི་ཞིང་རྣམས་སུ་དབྱངས་ཀྱིས་གོ་བར་བྱེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as flooding all buddha realms, beginning with the Unexcelled Heaven, with the sound of the teachings and thus bringing forth understanding.

source: སྟོང་གསུམ་དག་ཏུ་འོད་བཏང་ནས་སེམས་ཅན་རྣམས་རྟོགས་པར་བྱས་ཤིང་བདེ་བར་བྱས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline enables one to fill the trichiliocosm with a light that brings realization and happiness to sentient beings.

source: དམ་པའི་ཆོས་ཀྱི་ཆར་ཕབ་པའི་མཆོད་རྟེན་དུ་རལ་པ་ཅན་བདུན་བཏུལ་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is of the kind that enabled the taming of the seven ascetics with matted hair at the stūpa Rain of the Sacred Dharma.

source: ལྟེང་རྒྱས་འོད་སྲུང་དད་པར་བྱས་པའི་རྣམ་པར་འཕྲུལ་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is of the kind that created the miraculous display that instilled faith in the mind of Uruvilvā Kāśyapa.

source: བྲམ་ཟེའི་སེམས་ཀྱིས་བསམས་པ་མངོན་དུ་གཟིགས་ནས་ངའི་རུས་ནི་ཆེ་གེ་མོ་ཞིག་གོ་ཞེས་བཀའ་སྩལ་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration is of the kind that makes one intuit the thoughts of brahmins and say, ‘My family line is such and such.’

source: དུས་མཁྱེན་ནས་འདུལ་བ་ནི་དཔེར་ན་དགའ་བོའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as subduing through knowing times, as exemplified by Nanda.

source: འདི་དག་ནི་རྟོགས་པར་བྱེད་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections that foster realization.

source: འབེ་ལ་མས་བྲམ་ཟེ་རྣམས་ལ་སྦྱིན་པ་བྱིན་ནས་ཐམས་ཅད་ཀྱང་བྱང་ཆུབ་ཀྱི་ཕྱིར་རབ་ཏུ་བཀོད་པ་ནི་དཔེར་ན་སྐྱེ་དགུའི་བདག་མོ་ཆེན་མོ་གཽ་ཏ་མཱི་ལ་དགེ་འདུན་ལ་ཕུལ་ཅིག་ཅེས་བཀའ་སྩལ་པའི་ཚིག་དེས་ན་དགེ་སློང་བརྒྱད་སྟོང་དུལ་བར་བྱས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as establishing all brahmins in the pursuit of awakening as when Velāma gave offerings to the brahmins.For example, when Mahā­prajāpatī Gautamī was instructed, ‘Make offerings to the saṅgha,’ those words became the circumstance for the training of eight thousand monks.

source: ཡོངས་སུ་མྱ་ངན་ལས་འདས་པའི་སྡོམ་པ་ནི་དཔེར་ན་རྒྱལ་པོའི་བུ་ཟླ་བ་དང་། རྐང་བཀྲའི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline accomplishes the vows of parinirvāṇa, as exemplified by Prince Candra and Kalmāṣapada.

source: བཟོད་པ་ནི་དཔེར་ན་བཟོད་སྨྲས་ལྷ་བྱེ་བ་བརྒྱད་ཅུ་ཡོངས་སུ་སྨིན་པར་བྱས་པ་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as demonstrated by Kṣāntivādin, who ripened eight hundred million gods.

source: བརྩོན་འགྲུས་ནི་དཔེར་ན་བྲམ་ཟེའི་བུ་ལྔ་བརྒྱས་བྱང་ཆུབ་སེམས་དཔའ་མངོན་པར་ཤེས་པ་ལྔ་དང་ལྡན་པ་བསྐྲད་པ་དང་། བདུད་རངས་པར་གྱུར་པ་ལྟ་བུར་གྱུར་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is of the kind exerted by the Bodhisattva, who possessed the five superknowledges, when five hundred brahmin youths tried to expel him and the māras were delighted.

source: སྟོབས་བསྐྱེད་པའི་ཕྱིར་ཐོས་ནས་རྟོགས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration brings comprehension of what one has heard in order to engender strength.

source: འདི་ལྟར་ངས་གང་དུ་སྤོབས་པ་བསྐྱེད་པར་འཆར་ཀ་ཁྱོད་ཀྱིས་ཀྱང་སྤོབས་པ་སྐྱེད་ཅིག་ཅེས་བཀའ་སྩལ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens in the way whereby I said, ‘Udāyin, just as I have developed acumen, so shall you.’

source: འདི་དག་ནི་རྒྱ་ཆེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of vastness.

source: དེ་ལ་ཡིད་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of disenchantment?

source: ཡིད་བྱུང་བས་སྦྱིན་པ་བྱིན་པ་ནི་དཔེར་ན་རིག་པ་འདོན་པ་དང་། རྙེད་པ་དང་། བཀུར་སྟི་ལྟ་བུ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའོ། །
en: Generosity is to give due to disenchantment, as exemplified by chanting spells bestowing wealth and honors.

source: འདི་ལྟར་ཤཱཀྱ་རྣམས་ལ་ལས་རྣམས་ནི་ཆུད་ཟ་བར་མི་འགྱུར་རོ་ཞེས་བཀའ་སྩལ་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is demonstrated in teaching the Śakyas that the effects of karma do not dissipate.

source: འདི་ལྟར་དཔལ་སྦས་ཀྱི་དྲུང་དུ་གཤེགས་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is demonstrated in going before Śrīgupta.

source: འདི་ལྟར་སོག་མ་མེད་བཏུལ་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is demonstrated in the taming of Apalāla.

source: བྱང་ཆུབ་མངོན་པར་རྫོགས་པར་སངས་རྒྱས་ནས་ཅང་མི་གསུང་བར་བསམ་གཏན་གྱིས་བཞུགས་པ་ལ་གསོལ་བ་འདེབས་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the supplication to the Buddha, who upon awakening to perfect buddhahood remained silent in meditation.

source: འདི་ལྟར་སྦྲུལ་གདུག་པ་ལ་བརྟེན་ནས་ཐེག་པ་མཆོག་གསུང་བ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight is teaching the supreme vehicle based on poisonous snakes.

source: འདི་དག་ནི་ཡིད་བྱུང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of disenchantment.

source: དེ་ལ་གཞན་ལ་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections yielding virtue for others?

source: གཞན་ལ་བརྩེ་བའི་ཕྱིར་རང་གི་བདེ་བ་སྤངས་ཤིང་བདོག་པ་ཐམས་ཅད་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའོ། །
en: The perfection of generosity is to relinquish one’s own happiness and give all one’s possessions to others out of love.

source: འདི་ལྟར་བྱང་ཆུབ་སེམས་དཔའ་པད་མའི་སྙིང་པོས་བཙོན་གྱི་ཕྱིར་ངའི་རྒྱུས་ན་ཁྱོད་དགའ་བར་གྱུར་ཅིག །ཁྱོད་ཀྱི་ཕྱིར་ནི་ང་བསྣུན་ཀྱང་རུང་ཞེས་སྨྲས་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is that which is exemplified by the bodhisattva Lotus Essence, who declared for the sake of prisoners, ‘May you be happy because of my knowledge! Let me instead be harmed for your sake.’

source: འདི་ལྟར་བྱས་པ་གཟོ་བའི་རུ་སྦལ་ཤེས་བཞིན་དུ་ཚོང་པ་རྣམས་བསྒྲལ་བ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is that which is exemplified by the turtle who conscientiously saved the merchants out of gratitude.

source: འདི་ལྟར་ཉ་ལ་གྲོག་སྦུར་རྣམས་ཀྱིས་ཟོས་ཀྱང་ཆུར་མ་སོང་བ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is that which is exemplified by the fish who did not return to the water despite being eaten by ants.

source: སྲོག་ཆགས་རྣམས་ཀྱི་ཆེད་དུ་སྲིད་པ་ནི་མི་གཡོ་བ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration is imperturbable existence for the sake of living beings.

source: ཀུ་རུ་ཞེས་བྱ་བའི་མདོ་སྡེ་ལས་དཔེ་དབྱེ་བ་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight is as illustrated by the examples that appear in the discourse on Kuru.

source: འདི་དག་ནི་གཞན་ལ་དགེ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections yielding virtue for others.

source: དེ་ལ་གཞན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of others?

source: སྦྱིན་པ་བྱིན་ནས་དུལ་བར་བྱས་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity is taming by means of generosity.

source: རི་བོང་གིས་བྲམ་ཟེ་ང་ལ་ཟོ་ལ་ནགས་ཚལ་ན་འདུག་ཤིག་ཅེས་སྨྲས་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is that which is exemplified by the rabbit who said, ‘Eat me and stay in the forest.’

source: ཚངས་པས་ཤ་ཟའི་གཟུགས་ཀྱིས་སེམས་ཅན་རྣམས་བདེ་འགྲོར་ཁྲིད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is that which is exemplified by Brahmā, who took the form of a piśāca in order to lead sentient beings to the higher realms.

source: བྱང་ཆུབ་མ་ཐོབ་པའི་ཕྱིར་ངེས་པར་བྱུང་བའི་བརྩོན་འགྲུས་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence is the diligence toward deliverance because awakening has not yet been attained.

source: སྤྱི་བོ་དང་རིག་པ་གསུམ་གྱི་བསམ་གཏན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is the concentration pertaining to the highest and to the threefold knowledge.

source: སངས་རྒྱས་ཀྱི་ཆོས་མ་འདྲེས་པ་བཅྭ་བརྒྱད་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་སྟེ།
en: The perfection of insight is knowledge of the eighteen unique qualities of a buddha.

source: འདི་དག་ནི་གཞན་གྱི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of others.

source: དེ་ལ་ཡང་དག་པའི་སྤོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “There are six perfections for each of the correct abandonments.

source: སྡིག་པ་མི་དགེ་བ་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པར་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཡང་གང་ཞེ་ན།
en: What are the six perfections of ensuring that unwholesome factors that are presently absent do not arise?

source: སོ་སོར་བརྟགས་པའི་སྟོབས་ཀྱིས་ཉོན་མོངས་པ་ཀུན་ཏུ་མི་འབྱུང་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the nonarising of defilements due to the power of discernment.

source: མི་དགེ་བའི་རྣམ་པར་སྨིན་པ་མི་སྡུག་པ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་སོ། །
en: Discipline is the understanding of the unpleasant ripening of unvirtuous factors.

source: མི་དགེ་བའི་ངོ་བོ་ཁོང་དུ་ཆུད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའོ། །
en: Patience is comprehension of the essence of nonvirtue.

source: མི་སྐྱེ་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་སོ། །
en: Diligence is the understanding of no arising.

source: གཞན་ཡང་དག་པར་ལེན་དུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་ནོ། །
en: Concentration is causing others to take up the practice.

source: སྡིག་པ་མི་དགེ་བ་གཏན་དུ་མི་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་སྟེ།
en: Insight is the constant nonarising of unvirtuous factors.

source: འདི་དག་ནི་སྡིག་པ་མི་དགེ་བ་མ་སྐྱེས་པ་རྣམས་མི་བསྐྱེད་པར་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of ensuring that unwholesome factors that are presently absent do not arise.

source: དེ་ལ་སྐྱེས་པ་རྣམས་སྤོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of relinquishing present unwholesome factors?

source: ཉོན་མོངས་པ་སྐྱེས་པའི་སྐྱོན་མཐོང་ནས་འདོར་བ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as the discarding of defilements based on having seen their flaws.

source: དེ་ལ་སྨོན་པ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as aspiring to that.

source: དེ་སྤོང་ཞིང་འབར་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is relinquishment without the defilements flaring up.

source: ཉོན་མོངས་པ་ཤེས་ཤིང་ཤེས་པས་ཉོན་མོངས་པ་ཟིལ་གྱིས་གནོན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as understanding the defilements and conquering them through knowledge.

source: གང་ལ་རྟོག་ཅིང་དཔྱོད་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as analysis and discernment.

source: སྤོང་བ་དང་མི་སྐྱེ་བ་ཤེས་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the knowledge of relinquishment and nonarising.

source: འདི་དག་ནི་སྐྱེས་པ་རྣམས་སྤོང་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of relinquishing present unwholesome factors.

source: དེ་ལ་དགེ་བ་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པར་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of giving rise to virtuous factors that have not yet arisen?

source: དགེ་བ་ལ་འདུན་ཅིང་རྨོངས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as aspiring to virtue and being free from delusion.

source: དགེ་བ་ཐོབ་པ་ལ་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline is delighting in the attainment of virtue.

source: སྟོང་པ་ཉིད་ཀྱི་རྣམ་པས་དགེ་བ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is to think of virtue in terms of emptiness.

source: ལུས་དང་སེམས་ཀྱིས་ཕ་རོལ་གནོན་པ་ལ་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as the unimpeded ability to overcome others through mind and body.

source: འཐོབ་པ་དང་མཚན་མ་མེད་པར་འཛིན་པ་བརྗེད་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as not forgetting attainment and the absence of marks.

source: འཐོབ་པའི་རྒྱུ་ལ་མི་སྐྱེ་བ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པ་སྟེ།
en: The perfection of insight ripens as the knowledge of nonarising with respect to the causes of attainment.

source: འདི་དག་ནི་དགེ་བ་མ་སྐྱེས་པ་རྣམས་བསྐྱེད་པར་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of giving rise to virtuous factors that have not yet arisen.

source: དེ་ལ་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་ཕྱིར་ཞིང་གནས་པར་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of retaining the virtuous factors that have arisen?

source: དགེ་བ་སྐྱེས་པ་རྣམས་ཆུད་ཟ་བ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པའི་རྣམ་པར་སྨིན་པའོ། །
en: The perfection of generosity ripens as not wasting the virtuous factors that have arisen.

source: དེ་དག་ལ་མངོན་པར་དགའ་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as appreciating them.

source: སྦྱོར་བ་ལས་སྡོད་པ་ལས་ངེས་པར་བྱུང་བ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience is deliverance from being involved in engagements.

source: ཀུན་ཏུ་བསྲུང་ཞིང་ཀུན་ནས་མ་རྨོངས་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence means being hypervigilant and being free from total delusion.

source: བསྒོམ་པའི་སྟོབས་ཅན་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration ripens as the strength of familiarization.

source: ཡོངས་སུ་བསྔོ་བ་ཐམས་ཅད་ཀྱི་རྗེས་སུ་འཇུག་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the practice of subsequent dedication.

source: འདི་དག་ནི་དགེ་བའི་ཆོས་སྐྱེས་པ་རྣམས་ཕྱིར་ཞིང་གནས་པར་བྱ་བའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of retaining the virtuous factors that have arisen.

source: དེ་ལ་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “There are six perfections for each of the bases of miraculous power.

source: དེ་ལ་འདུན་པ་སྤོང་བ་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་པོ་ཡང་གང་ཞེ་ན།
en: What are the six perfections of the intention-suffused base of miraculous power?

source: འདུན་པ་དེ་སྐྱེ་བ་ལ་ཐོགས་པ་མེད་པ་གང་ཡིན་པ་དེ་ནི་སྦྱིན་པའིའོ། །
en: Generosity ripens as the unhindered arising of intention.

source: འདུན་པ་དེ་མི་གཏོང་བ་གང་ཡིན་པ་དེ་ནི་ཚུལ་ཁྲིམས་ཀྱིའོ། །
en: Discipline ripens as not losing the intention.

source: འདུན་པ་དེ་བརྗོད་པ་གང་ཡིན་པ་དེ་ནི་བཟོད་པའིའོ། །
en: Patience ripens as the expression of intention.

source: འདུན་པ་ངེས་པར་བྱུང་བ་འཛིན་པ་གང་ཡིན་པ་དེ་ནི་བརྩོན་འགྲུས་ཀྱིའོ། །
en: Diligence ripens as adhering to the intention to attain deliverance.

source: དེ་ལ་རྟོག་པ་གང་ཡིན་པ་དེ་ནི་བསམ་གཏན་གྱིའོ། །
en: Concentration arises as the thought of that.

source: འདུན་པ་དེ་ལ་ངེས་པར་ཐོབ་པ་གང་ཡིན་པ་དེ་ནི་ཤེས་རབ་ཀྱི་སྟེ།
en: Insight ripens as the attainment of certainty regarding the intention.

source: འདི་དག་ནི་འདུན་པ་སྤོང་བ་དང་ལྡན་པའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གོ། །
en: Such are the six perfections of the intention-suffused base of miraculous power.

source: དེ་ལ་བརྩོན་འགྲུས་སྤོང་བའི་རྫུ་འཕྲུལ་གྱི་རྐང་པའི་ཕ་རོལ་ཏུ་ཕྱིན་པ་དྲུག་གང་ཞེ་ན།
en: “What are the six perfections of the diligence-suffused base of miraculous power?
